[{"caption":"polygon.com","comment_count":309,"comment_like_count":105,"created_time":"2014-07-23T05:55:02+0000","description":"Content warning: This post contains graphic language, slurs and triggering content","from":{"id":"10152877171134343","name":"Erik Hellman"},"icon":"https://www.facebook.com/images/icons/post.gif","id":"133054986743582_715763575139384","is_expired":false,"is_hidden":false,"like_count":46,"link":"http://www.polygon.com/2014/7/22/5926193/women-gaming-harassment","message":"Dags att prata mer om avsaknaden av kvinnor inom mjukvaruutveckling.\n\n'A male friend of mine that develops AAA games told me, \"When a woman criticizes me, it goes to a different part of my brain than when a man on my team does. I get defensive really quickly. I’m trying to get better about it.\" I don’t think his is a unique experience.'\n\nKänns det igen? Artikeln handlar om kvinnor inom spelindustrin, men det är nog inte alltför vågat att anta att det är ganska likt inom övrig mjukvaruutveckling också.","name":"No skin thick enough: The daily harassment of women in the game industry","picture":"https://fbexternal-a.akamaihd.net/safe_image.php?d=AQBOZSUasBVJVz1J&w=130&h=130&url=http%3A%2F%2Fcdn1.vox-cdn.com%2Fuploads%2Fchorus_image%2Fimage%2F35916316%2Fwreckedcity.0_cinema_1280.0.jpg&cfs=1","status_type":"shared_story","type":"link","updated_time":"2014-07-28T08:53:26+0000"},{"comment_count":220,"comment_like_count":189,"created_time":"2014-08-12T15:07:33+0000","from":{"id":"10152360846261634","name":"Niklas Mårdby"},"id":"133054986743582_726617770720631","is_expired":false,"is_hidden":false,"like_count":13,"message":"Hej alla kodapor! Jag jobbar som gymnasielärare och undervisar i programmering. Jag har en liten fråga: vilket programmeringsspråk är bäst att använda för att lära ut programmering tycker du? Tänk dig nu att detta är första programmeringskursen för personen och den ska lägga grunden för framtida programmeringsstudier och inte göra personen anställningsbar. Motivera gärna ditt svar! :D","subscribed":true,"type":"status","updated_time":"2014-08-14T19:55:46+0000"},{"comment_count":174,"comment_like_count":136,"created_time":"2014-06-28T21:48:30+0000","from":{"id":"10152269852237093","name":"Adam Rehal"},"id":"133054986743582_702089633173445","is_expired":false,"is_hidden":false,"like_count":23,"message":"Finns här några kvinnliga kodapor? Verkar endast vara män i den här gruppen men det måste väl även finnas skillade kvinnor som kodar koden? Hur många utvecklare känner ni som är duktiga och som inte är män?","subscribed":true,"type":"status","updated_time":"2014-07-10T20:59:33+0000"},{"caption":"idg.se","comment_count":173,"comment_like_count":88,"created_time":"2014-10-20T09:33:50+0000","description":"Den nya överklassen koketterar med teknisk kunskap och försvarar sin upphöjda position med vilka medel som helst, skriver Piratpartiets Anna Troberg.","from":{"id":"10152594017266880","name":"Hanna Söderström"},"icon":"https://www.facebook.com/images/icons/post.gif","id":"133054986743582_760838323965242","is_expired":false,"is_hidden":false,"like_count":19,"link":"http://www.idg.se/2.1085/1.589886/den-tekniska-overklassen-ser-ner-pa-kvinnor","message":"Utan att bli för politisk, men med tanke på just könsfördelning osv, tycker ni Anna Troberg har en poäng, eller är hon helt ute och cyklar?\n\nJag skulle säga att IT-män förmodligen är de mest medvetna och jämställdhetsvärderande av alla yrkesgrupper, så jag tycker det är lite märkligt, med tanke på hur kvinnosynen ser ut bland andra klassiskt manliga yrkesgrupper... Jag blir faktiskt förnärmad, åh mina manliga vänners vägnar, vid antydan att dom inte skulle ha samma självklara synsätt som mig, vid att det är helt fel att hacka och lämna ut privata bilder etc.. Jag har aldrig stött på den åsikten. I \nvilket knasigt forum är den norm?","name":"\"Den tekniska överklassen ser ner på kvinnor\"","picture":"https://external.xx.fbcdn.net/safe_image.php?d=AQDnxWKV9bQJWbaE&w=130&h=130&url=http%3A%2F%2Fwww.idg.se%2Fpolopoly_fs%2F1.589886.1413787474%21topTeaserImage%2FimageTypeSelector%2FlocalImage%2F2502339504.jpg&cfs=1&sx=137&sy=0&sw=360&sh=360","status_type":"shared_story","subscribed":true,"type":"link","updated_time":"2014-10-22T10:24:56+0000"},{"comment_count":162,"comment_like_count":98,"created_time":"2014-06-03T18:50:25+0000","from":{"id":"10203257243931324","name":"Lars C. Magnusson"},"id":"133054986743582_686374251411650","is_expired":false,"is_hidden":false,"like_count":5,"message":"Varför hatar folk php?","subscribed":true,"type":"status","updated_time":"2014-06-04T09:00:10+0000"},{"comment_count":160,"comment_like_count":64,"created_time":"2014-06-27T13:49:14+0000","from":{"id":"991108717570581","name":"Jacob Carlsson"},"id":"133054986743582_701340466581695","is_expired":false,"is_hidden":false,"like_count":2,"message":"På vilka företag jobbar ni kodapor på? skulle vara roligt att se vilket företag som har flest kodapor i denna grupp ;)\n\nSjälv så sitter jag hos Bovision, https://www.facebook.com/bovision?fref=ts","subscribed":true,"type":"status","updated_time":"2014-06-28T17:07:42+0000"},{"comment_count":145,"comment_like_count":109,"created_time":"2014-10-26T17:00:45+0000","from":{"id":"10152831040860609","name":"Peter Elmered"},"id":"133054986743582_764052266977181","is_expired":false,"is_hidden":false,"like_count":4,"message":"Vad har ni för erfarenheter av bonussystem för utvecklare? Vad är det som fungerar(motiverar), är rättvist och ger bra utdelning till duktiga och hårt jobbande utvecklare? Det bör också vara anpassat så att även de som jobbar med t.ex. Support eller QA kan få ta del av bonussystemet.\nSka det vara individuell eller kollektiv bonus? Eller ingen bonus alls? \nEftersom jag är en person som jobbar hårt, prioriterar jobbet och gärna gör det lilla extra vill jag även att det ska synas på lönen när man har jobbat extra hårt som en extra morot.","type":"status","updated_time":"2014-10-30T15:47:25+0000"},{"comment_count":145,"comment_like_count":24,"created_time":"2014-01-28T14:14:18+0000","from":{"id":"10152350510242827","name":"Poyan Nabati"},"id":"133054986743582_620528824662860","is_expired":false,"is_hidden":false,"like_count":2,"message":"Miljonte laptoptråden men... Macbook Pro, bör man köra på 13\" eller 15\"? Delvis tänker jag på den större skärmytan (hur mycket bekvämare är det att jobba på?) och den starkare processorn på den senare (är det någon skillnad?).","subscribed":true,"type":"status","updated_time":"2014-01-29T11:02:17+0000"},{"comment_count":142,"comment_like_count":122,"created_time":"2015-08-18T21:06:57+0000","from":{"id":"1612640942356863","name":"Jonathan Höglund"},"id":"133054986743582_908479429201130","is_expired":false,"is_hidden":false,"like_count":2,"message":"Har en liten fråga till er kodapor. Vilket språk tycker ni har \"skönast\" syntax. Oavsett vad ni kodar för något, det språk som känns absolut roligast att skriva i.","subscribed":true,"type":"status","updated_time":"2015-08-20T19:21:15+0000"},{"comment_count":140,"comment_like_count":38,"created_time":"2014-07-04T05:32:32+0000","from":{"id":"10204866991611665","name":"Robin Mörk Grass"},"id":"133054986743582_705329079516167","is_expired":false,"is_hidden":false,"like_count":7,"message":"Utan att starta ett flamewar; Vilken editor/IDE använder ni?\n\nSjälv gick jag från Sublime Text 2 till Atom.io när det släpptes, och är sjukt nöjd (passar mitt sätt att arbeta). Det var lite 'mjeh' i början dock. :)","subscribed":true,"type":"status","updated_time":"2014-07-23T14:08:26+0000"},{"comment_count":140,"comment_like_count":82,"created_time":"2014-06-23T17:46:29+0000","from":{"id":"731172410307798","name":"Henrik Fransas"},"id":"133054986743582_699074046808337","is_expired":false,"is_hidden":false,"like_count":169,"message":"Har tänkt på en sak när jag läst kommentarer här den senaste tiden och det är att det hela tiden dras upp om man är \"riktig\" kodare eller inte. \nJag tycker det är ett jävla skitsnack, vi har inte någon adel och bondesamhälle inom utvecklarbranschen. En utvecklare är en utvecklare oavsett vilket språk, plattform personen jobbar på och emot, ingen är bättre bara för att denne tex gör allt i maskinspråk och pratar flytande ettor och nollor.\n\nAtt programmera kan vara att skriva minnesnära kod, men också att skriva wordpressanpassningar, båda är lika viktiga! \nJag tycker att det är viktigt att vi slutar att prata skit, nedvärdera eller ranka personer, varken här eller i övriga samhället för precis som att det är lika viktigt att tex en städare som en läkare finns för att samhället ska fungera så behövs utvecklare inom alla möjliga områden!","type":"status","updated_time":"2014-06-25T10:06:58+0000"},{"comment_count":135,"comment_like_count":97,"created_time":"2015-01-29T20:27:59+0000","from":{"id":"10201666449817878","name":"Johan Furuskog"},"id":"133054986743582_814418931940514","is_expired":false,"is_hidden":false,"like_count":1,"message":"Utvecklingsmiljö på Jobbet?\nVi kör mot en server som alla delar sedan synkar vi ut till ett flertal servrar. Vi kör inte versionshantering och utvecklar inte lokalt. Vilket gör att jag inte kan nyttja gulp, grunt, Composer eller andra godbitar eftersom de andra helst vill ha det som det alltid har varit. Hur ser det ut för er andra har ni det lättare än jag? :) Några förslag?","subscribed":true,"type":"status","updated_time":"2015-01-31T14:44:22+0000"},{"comment_count":135,"comment_like_count":96,"created_time":"2014-06-04T07:59:16+0000","from":{"id":"10152512622766229","name":"Tobias Ritzau"},"id":"133054986743582_686712784711130","is_expired":false,"is_hidden":false,"like_count":4,"message":"Vilka språk älskar folk?","subscribed":true,"type":"status","updated_time":"2014-06-08T20:03:55+0000"},{"comment_count":133,"comment_like_count":47,"created_time":"2014-10-12T13:26:09+0000","from":{"id":"10204037381593550","name":"Christoffer Skogh"},"id":"133054986743582_756649787717429","is_expired":false,"is_hidden":false,"like_count":0,"message":"Vet inte om man kan be om hjälp med just sånt här så radera detta om det inte får era bananer att bli gula. \nJag har en array som innehåller upp till 4 objekt, varje objekt innehåller en namn property, och sen tar jag in input från användaren där ett namn anges. Då vill jag med hjälp av denna input söka igenom arrayen och hitta objektet där inputen matchar namn propertyn, och returnera objektets index. Suttit och letat runt lite men tycks inte hitta något vettigt. Kanske nån av er har nå förslag på hur jag ska göra detta?","subscribed":true,"type":"status","updated_time":"2014-10-15T07:16:40+0000"},{"comment_count":131,"comment_like_count":140,"created_time":"2014-12-11T22:10:12+0000","from":{"id":"10153285026667166","name":"Rikard Berg"},"id":"133054986743582_787747084607699","is_expired":false,"is_hidden":false,"like_count":5,"message":"Ok, nytt försök:\nVad är erat favoritord, i vilket språk? (naturligtvis programmeringsspråk...)","type":"status","updated_time":"2014-12-14T11:04:13+0000"},{"comment_count":128,"comment_like_count":62,"created_time":"2014-12-17T21:24:26+0000","from":{"id":"10152410914037232","name":"Johan Gudmundsson"},"id":"133054986743582_790735527642188","is_expired":false,"is_hidden":false,"like_count":7,"message":"Med risk för lite OT.. Men jag tycker endå det är relevant.\n\nI och med nedsläckningen av TPB samt att vi har kodapor här inom både webbapplikationer och annan mjukvara.\n\nHur ser du på fildelning av upphovsrättsskyddat material (och motivera)?\n\nJag börjar jag då. Jag är strängt emot det så länge som det finns någon som drar vinster av det som t.ex TPB. Däremot helt för det så länge som det inte är vinstdrivande projekt.\n\nMin motivering: Idag så laddar jag inte ner och jag spenderar många 1000$ på mjukvaror/år. Men en gång i tiden så var jag ung och utan pengar (si så där 10-17år) och hade det då inte vart för fildelning, så hade jag aldrig haft den kunskap och karriär som jag har idag. Jag hade helt enkelt ALDRIG kunna spotta upp pengarna för ens så simpla saker som nya Windows Versioner eller Photoshop. Så tack vare fildelningen så anser jag att jag idag har en betydligt högre inkomst idag även om jag inte fildelat och därmed kan spendera bra mycket mer pengar på programvara idag, som jag aldrig hade haft råd att köpa annars.\n\nEDIT: Anledningen till att jag fann detta relevant just för kodapor, är eftersom de flesta av oss är är med och skapar produkter och annat som är skyddat av upphovsrättslagen. Samtidigt som säkert många av oss är uppväxta under piratkopierings storhetstid (80-90-talet), och vart med på en del lan, hack och andra miljöer där faktiskt fildelningen växte fram.","type":"status","updated_time":"2014-12-19T08:33:57+0000"},{"comment_count":127,"comment_like_count":119,"created_time":"2014-11-30T20:52:09+0000","from":{"id":"310513332432020","name":"Julia Christina Eneroth"},"id":"133054986743582_781663225216085","is_expired":false,"is_hidden":false,"like_count":31,"message":"I en facebookgrupp jag trodde var kodapor såg jag en länk med titeln \"Let's create a language with all the features we hate!\". Dock visade det sig att detta var en grupp för människospråk och inte kodspråk :( . Men, för att komma till saken, om vi skulle skapa ett språk på detta tema, hur skulle det då se ut? vad tycker kodaporna ska vara med och vad ska inte vara med?","type":"status","updated_time":"2014-12-02T09:08:52+0000"},{"comment_count":127,"comment_like_count":67,"created_time":"2014-06-11T22:35:42+0000","from":{"id":"10203393157653054","name":"Johan Bössfall"},"id":"133054986743582_691846227531119","is_expired":false,"is_hidden":false,"like_count":10,"message":"Om man skulle börja koda, var skulle man börja? Finns det några bra hjälpmedel?\n(Tänk nu på att jag har absolut ingen aning vad det innebär att koda, varför man gör det och hur det går till) \nVet endast det jag har lyckats snappa upp från varierande diskussioner från denna grupp!\n(Fråga mig inte hur jag hamnade här :D)\nTackar på förhand kära Kodapor!","type":"status","updated_time":"2014-06-12T22:46:51+0000"},{"comment_count":127,"comment_like_count":63,"created_time":"2014-06-02T18:50:41+0000","from":{"id":"10152068010080509","name":"Daniel Lastword Wahlqvist"},"id":"133054986743582_685679318147810","is_expired":false,"is_hidden":false,"like_count":37,"message":"Direkt från WWDC, Apple presenterar nytt programmeringsspråk; Swift!","type":"status","updated_time":"2014-06-04T23:43:08+0000"},{"comment_count":125,"comment_like_count":62,"created_time":"2015-07-29T13:09:26+0000","from":{"id":"336946459786341","name":"Richard Eriksson"},"id":"133054986743582_897869020262171","is_expired":false,"is_hidden":false,"like_count":23,"message":"Så. Win10 installerat på maskinerna... Och jag har testat lite mjukvara: \n\nDrivrutiner- \n\n4/10 st. trasiga, vill inte installeras alls, installationsprogrammet stängs ned. Däribland till min Joystick för 7000 spänn. Tack för den. Funkade i 8.1... Problem med NVidia drivare, om jag lägger till NVidias egna skriver Win över dem vid omstart. Multiskärm ger visst flimmer... Upplösningar saknas från 8.1\n\nNytta- \n\n3/5 trasiga. Fönster som är blanka, fullskärmsläget i SyncLab är inte valbart, en mjukvaruemulator för 68k som inte längre kan starta (\"missing defines\"). Funkade i 8.1\n\nNöje-\n\n6/10 trasiga. DCS World saknar 1080 i upplösningar, DIRT Rally alfan startar inte längre, RaceRoom startar men saknar alla upplösningar utom 720p och klarar inte längre multimonitor. Wargame ALB har framerateproblem i DX11 och inga upplösningar alls i DX9. \n\nGOG-spel remade för Win8 jag testat går långsamt och flimrar. Performanceproblem. DosBox kan inte VSynca längre... \n\nVSync funkar ibland ibland inte i alla spel jag testat so far. \n\nAlla funkade i 8.1\n\nFör så lite ändringar så är det katastrofalt! \n\nDx9 är i praktiken trasigt på multimonitor, saknar vsync och upplösningar.\n\nAlt Tab ger fel skärm aktiv ibland vid multimonitor...\n\nFör er som menade att allt som funkade innan (nyare mjukvara) skulle klara sig... Not so much.","type":"status","updated_time":"2015-08-17T16:59:08+0000"}]